arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_cmp_hal.h
    BITBAND_ACCESS32(&(baseAddr->C0), CMP_C0_OPE_SHIFT) = to_set;
}

/*!
 * @brief Verify if the analog comparator module is enabled
 * @param baseAddr - cmp base pointer
 * @return - module state
 *  true - module is enabled
 *  false - module is disabled
 */
static inline bool CMP_HAL_GetAnalogComparatorState(CMP_Type* const baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->C0), CMP_C0_EN_SHIFT);
}

/*!
 * @brief Set the analog comparator module state
 * @param baseAddr - cmp base pointer
 * @param to_set - analog comparator module state
 *  true - module is enabled
 *  false - module is disabled
 */
static inline void CMP_HAL_SetAnalogComparatorState(CMP_Type* const baseAddr, bool to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C0), CMP_C0_EN_SHIFT) = to_set;
}

/*!
 * @brief Return the number of consecutive samples that must agree prior to the comparator output filter
accepting a new output state
 * @param baseAddr - cmp base pointer
 * @return - filter sample count
 */
static inline uint8_t CMP_HAL_GetFilterSampleCount(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C0;
    tmp = (tmp & CMP_C0_FILTER_CNT_MASK) >> CMP_C0_FILTER_CNT_SHIFT;
    return ( uint8_t ) (tmp);
}

/*!
 * @brief Set the number of consecutive samples that must agree prior to the comparator output filter
accepting a new output state
 * @param baseAddr - cmp base pointer
 * @param to_set - filter sample count(min value 0, max value 7)
 * @return - void
 */
static inline void CMP_HAL_SetFilterSampleCount(CMP_Type* const baseAddr, uint8_t to_set)
{
    uint32_t tmp = baseAddr->C0;
    baseAddr->C0 &= ~(CMP_C0_SE_MASK & CMP_C0_FPR_MASK & CMP_C0_FILTER_CNT_MASK);
    tmp &= ~(CMP_C0_FILTER_CNT_MASK);
    tmp |= CMP_C0_FILTER_CNT(to_set);
    baseAddr->C0 = tmp;
}

/*!
 * @brief Return the current offset level
 * @param baseAddr - cmp base pointer
 * @return - offset level
 *  CMP_LEVEL_OFFSET_0
 *  CMP_LEVEL_OFFSET_1
 */
static inline cmp_offset_t CMP_HAL_GetOffset(CMP_Type* const baseAddr)
{
    return (cmp_offset_t)BITBAND_ACCESS32(&(baseAddr->C0), CMP_C0_OFFSET_SHIFT);
}

/*!
 * @brief Set the offset level
 * @param baseAddr - cmp base pointer
 * @param to_set - offset level
 *  CMP_LEVEL_OFFSET_0
 *  CMP_LEVEL_OFFSET_1
 * @return - void
 */
static inline void CMP_HAL_SetOffset(CMP_Type* const baseAddr, cmp_offset_t to_set)
{
    uint32_t tmp = baseAddr->C0;
    tmp &= ~(CMP_C0_OFFSET_MASK);
    tmp |= CMP_C0_OFFSET(to_set);
    baseAddr->C0 = tmp;
}

/*!
 * @brief Return the current hysteresis level
 * @param baseAddr - cmp base pointer
 * @return - current hysteresis level
 *  CMP_LEVEL_HYS_0
 *  CMP_LEVEL_HYS_1
 *  CMP_LEVEL_HYS_2
 *  CMP_LEVEL_HYS_3
 */
static inline cmp_hysteresis_t CMP_HAL_GetHysteresis(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C0;
    tmp = (tmp & CMP_C0_HYSTCTR_MASK) >> CMP_C0_HYSTCTR_SHIFT;
    return ( cmp_hysteresis_t ) (tmp);
}

/*!
 * @brief Set the hysteresis level
 * @param baseAddr - cmp base pointer
 * @param to_set - hysteresis level
 *  CMP_LEVEL_HYS_0
 *  CMP_LEVEL_HYS_1
 *  CMP_LEVEL_HYS_2
 *  CMP_LEVEL_HYS_3
 * @return - void
 */
static inline void CMP_HAL_SetHysteresis(CMP_Type* const baseAddr, cmp_hysteresis_t to_set)
{
    uint32_t tmp = baseAddr->C0;
    tmp &= ~(CMP_C0_HYSTCTR_MASK);
    tmp |= CMP_C0_HYSTCTR(to_set);
    baseAddr->C0 = tmp;
}


/*!
 * @brief Set if the DAC output is enabled to go outside of this block
 * @param baseAddr - cmp base pointer
 * @param to_set - DAC output state
 *  true - DAC output go outside of DAC block(to packaged pin)
 *  false - DAC output doesn't go outside of DAC block(to packaged pin)
 * @return - void
 */
static inline void CMP_HAL_SetDACOutputState(CMP_Type* const baseAddr, bool to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C0), CMP_C0_EN_SHIFT) = to_set;
}

/*!
 * @brief Return the current source for positive port of the comparator
 * @param baseAddr - cmp base pointer
 * @return - signal source
 *  CMP_DAC
 *  CMP_MUX
 */
static inline cmp_port_mux_t CMP_HAL_GetPositivePortInput(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C1;
    tmp = (tmp & CMP_C1_INPSEL_MASK) >> CMP_C1_INPSEL_SHIFT;
    return ( cmp_port_mux_t ) (tmp);
}

/*!
 * @brief Set the source for positive port of the comparator
 * @param baseAddr cmp base pointer
 * @param to_set - signal source
 *  CMP_DAC
 *  CMP_MUX
 * @return - void
 */
static inline void CMP_HAL_SetPositivePortInput(CMP_Type* const baseAddr, cmp_port_mux_t to_set)
{
    uint32_t tmp = baseAddr->C1;
    tmp &= ~(CMP_C1_INPSEL_MASK);
    tmp |= CMP_C1_INPSEL(to_set);
    baseAddr->C1 = tmp;
}

/*!
 * @brief Return the current source for negative port of the comparator
 * @param baseAddr - cmp base pointer
 * @return - signal source
 *  CMP_PLUS_FIXED
 *  CMP_MINUS_FIXED
 */
static inline cmp_port_mux_t CMP_HAL_GetNegativePortInput(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C1;
    tmp = (tmp & CMP_C1_INNSEL_MASK) >> CMP_C1_INNSEL_SHIFT;
    return ( cmp_port_mux_t ) (tmp);
}

/*!
 * @brief Set the source for negative port of the comparator
 * @param baseAddr - cmp base pointer
 * @param to_set - signal source
 *  CMP_PLUS_FIXED
 *  CMP_MINUS_FIXED
 * @return - void
 */
static inline void CMP_HAL_SetNegativePortInput(CMP_Type* const baseAddr, cmp_port_mux_t to_set)
{
    uint32_t tmp = baseAddr->C1;
    tmp &= ~(CMP_C1_INNSEL_MASK);
    tmp |= CMP_C1_INNSEL(to_set);
    baseAddr->C1 = tmp;
}

/*!
 * @brief Return which channels are used for round-robin checker
 * @param baseAddr - cmp base pointer
 * @return - channels states, one bite for each channel state 
 * |---------|---------|-----|---------|---------|
 * |CH7_state|CH6_state|.....|CH1_state|CH0_state|
 * |---------|---------|-----|---------|---------|
 */
static inline cmp_ch_list_t CMP_HAL_GetRoundRobinChannels(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C2;
    tmp &= CMP_ROUND_ROBIN_CHANNELS_MASK;
    return(cmp_ch_list_t) tmp >> CMP_ROUND_ROBIN_CHANNELS_SHIFT;
}

/*!
 * @brief Set which channels are use for round-robin checker
 * @param baseAddr - cmp base pointer
 * @param to_set - channels states, one bite for each channel state
 * |---------|---------|-----|---------|---------|
 * |CH7_state|CH6_state|.....|CH1_state|CH0_state|
 * |---------|---------|-----|---------|---------|
 * @return - void
 */
static inline void CMP_HAL_SetRoundRobinChannels(CMP_Type* const baseAddr, cmp_ch_list_t to_set)
{
    uint32_t tmp = baseAddr->C1;
    tmp &= ~(CMP_ROUND_ROBIN_CHANNELS_MASK);
    tmp |= to_set << CMP_ROUND_ROBIN_CHANNELS_SHIFT;
    baseAddr->C1 = tmp;
}

/*!
 * @brief Verify if the DAC is enabled
 * @param baseAddr - cmp base pointer
 * @return - dac state
 *  true - DAC is enabled
 *  false - DAC is disabled
 */
static inline bool CMP_HAL_GetDACState(CMP_Type* const baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->C1), CMP_C1_DACEN_SHIFT);
}

/*!
 * @brief Set the DAC state (enabled/disabled)
 * @param baseAddr - cmp base pointer
 * @param to_set - DAC state
 *  true - DAC is enabled
 *  false - DAC is disabled
 * @return - void
 */
static inline void CMP_HAL_SetDACState(CMP_Type* const baseAddr, bool to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C1), CMP_C1_DACEN_SHIFT) = to_set;
}

/*!
 * @brief Return the current voltage reference
 * @param baseAddr - cmp base pointer
 * @return - voltage referece
 *  CMP_VIN1
 *  CMP_VIN2
 */
static inline cmp_voltage_reference_t CMP_HAL_GetVoltageReference(CMP_Type* const baseAddr)
{
    return (cmp_voltage_reference_t)BITBAND_ACCESS32(&(baseAddr->C1), CMP_C1_VRSEL_SHIFT);
}

/*!
 * @brief Set the voltage reference
 * @param baseAddr - cmp base pointer
 * @param to_set - voltage reference
 *  CMP_VIN1
 *  CMP_VIN2
 * @return - void
 */
static inline void CMP_HAL_SetVoltageReference(CMP_Type* const baseAddr, cmp_voltage_reference_t to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C1), CMP_C1_VRSEL_SHIFT) = to_set;
}

/*!
 * @brief Determine which input is selected for the plus mux
 * @param baseAddr - cmp base pointer
 * @return - channel for the plus mux
 */
static inline cmp_ch_number_t CMP_HAL_GetPlusMUXControl(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C1;
    tmp = (tmp & CMP_C1_PSEL_MASK) >> CMP_C1_PSEL_SHIFT;
    return ( cmp_ch_number_t ) (tmp);
}

/*!
 * @brief Select input for the plus mux
 * @param baseAddr cmp base pointer
 * @param to_set - channel for the plus mux
 * @return - void
 */
static inline void CMP_HAL_SetPlusMuxControl(CMP_Type* const baseAddr, cmp_ch_number_t to_set)
{
    uint32_t tmp = baseAddr->C1;
    tmp &= ~(CMP_C1_PSEL_MASK);
    tmp |= CMP_C1_PSEL(to_set);
    baseAddr->C1 = tmp;
}

/*!
 * @brief Determine which input is selected for the minus mux
 * @param baseAddr - cmp base pointer
 * @return - channel for the minus mux
 */
static inline cmp_ch_number_t CMP_HAL_GetMinusMUXControl(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C1;
    tmp = (tmp & CMP_C1_MSEL_MASK) >> CMP_C1_MSEL_SHIFT;
    return ( cmp_ch_number_t ) (tmp);
}

/*!
 * @brief Select input for the minus mux
 * @param baseAddr - cmp base pointer
 * @param to_set - channel for the minus mux
 * @return - void
 */
static inline void CMP_HAL_SetMinusMUXControl(CMP_Type* const baseAddr, cmp_ch_number_t to_set)
{
    uint32_t tmp = baseAddr->C1;
    tmp &= ~(CMP_C1_MSEL_MASK);
    tmp |= CMP_C1_MSEL(to_set);
    baseAddr->C1 = tmp;
}

/*!
 * @brief Return the current output voltage level(0-255)
 * @param baseAddr - cmp base pointer
 * @return - voltage level
 */
static inline uint8_t CMP_HAL_GetVoltage(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C1;
    tmp = (tmp & CMP_C1_VOSEL_MASK) >> CMP_C1_VOSEL_SHIFT;
    return ( uint8_t ) (tmp);
}

/*!
 * @brief Set the output voltage level
 * @param baseAddr - cmp base pointer
 * @param to_set - voltage level
 * @return - void
 */
static inline void CMP_HAL_SetVoltage(CMP_Type* const baseAddr, uint8_t to_set)
{
    uint32_t tmp = baseAddr->C1;
    tmp &= ~(CMP_C1_VOSEL_MASK);
    tmp |= CMP_C1_VOSEL(to_set);
    baseAddr->C1 = tmp;
}

/*!
 * @brief Verify if the round robin operation is enabled
 * @param baseAddr -cmp base pointer
 * @return - round-robin operation state
 *  true - round robin operation is enabled
 *  false - round robin operation is disabled
 */
static inline bool CMP_HAL_GetRoundRobinState(CMP_Type* const baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->C2), CMP_C2_RRE_SHIFT);
}

/*!
 * @brief Set the round robin operation state
 * @param baseAddr cmp base pointer
 * @param to_set - round robin operation state
 *  true - round robin operation is enabled
 *  false - round robin operation is disabled
 * @return - void
 */
static inline void CMP_HAL_SetRoundRobinState(CMP_Type* const baseAddr, bool to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C2), CMP_C2_RRE_SHIFT) = to_set;
}

/*!
 * @brief Verify if the round robin interrupt is enabled
 * @param baseAddr - cmp base pointer
 * @return - round-robin interrupt state
 *  true - round robin interrupt is enabled
 *  false - round robin interrupt is disabled
 */
static inline bool CMP_HAL_GetRoundRobinInterruptState(CMP_Type* const baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->C2), CMP_C2_RRIE_SHIFT);
}

/*!
 * @brief Set the round robin interrupt state
 * @param baseAddr - cmp base pointer
 * @param to_set - round robin interrupt state
 *  true - round robin interrupt is enabled
 *  false - round robin interrupt is disabled
 * @return - void
 */
static inline void CMP_HAL_SetRoundRobinInterruptState(CMP_Type* const baseAddr, bool to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C2), CMP_C2_RRIE_SHIFT) = to_set;
}

/*!
 * @brief Return the port fixed for round-robin operation
 * @param baseAddr - cmp base pointer
 * @return - fixed port
 */
static inline cmp_fixed_port_t CMP_HAL_GetFixedPort(CMP_Type* const baseAddr)
{
    return (cmp_fixed_port_t)BITBAND_ACCESS32(&(baseAddr->C2), CMP_C2_FXMP_SHIFT);
}

/*!
 * @brief Set the fixed port for round-robin operation
 * @param baseAddr - cmp base pointer
 * @param to_set - fixed port
 *  CMP_PLUS_FIXED
 *  CMP_MINUS_FIXED
 * @return - void
 */
static inline void CMP_HAL_SetFixedPort(CMP_Type* const baseAddr, cmp_fixed_port_t to_set)
{
    BITBAND_ACCESS32(&(baseAddr->C2), CMP_C2_FXMP_SHIFT) = to_set;
}

/*!
 * @brief Return which channel is selected for fixed mux port(as fixed reference)
 * @param baseAddr - cmp base pointer
 * @return - fixed channel 
 *  CMP_PLUS_FIXED
 *  CMP_MINUS_FIXED
 */
static inline cmp_ch_number_t CMP_HAL_GetFixedChannel(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C2;
    tmp = (tmp & CMP_C2_FXMXCH_MASK) >> CMP_C2_FXMXCH_SHIFT;
    return ( cmp_ch_number_t ) (tmp);
}

/*!
 * @brief Set which channel is used as the fixed reference input for the fixed mux port
 * @param baseAddr - cmp base pointer
 * @param to_set - fixed channel
 * @return - void
 */
static inline void CMP_HAL_SetFixedChannel(CMP_Type* const baseAddr, cmp_ch_number_t to_set)
{
    uint32_t tmp = baseAddr->C2;
    tmp &= ~(CMP_C2_FXMXCH_MASK);
    tmp |= CMP_C2_FXMXCH(to_set);
    baseAddr->C2 = tmp;
}

/*!
 * @brief Return all input changed flags
 * @param baseAddr - cmp base pointer
 * @return - flags status
 * |--------|--------|-----|--------|--------|
 * |CH7_flag|CH6_flag|.....|CH1_flag|CH0_flag|
 * |--------|--------|-----|--------|--------|
 */
static inline cmp_ch_list_t CMP_HAL_GetInputChangedFlags(CMP_Type* const baseAddr)
{   
    uint32_t tmp = baseAddr->C2;
    tmp = (tmp & CMP_INPUT_FLAGS_MASK) >> CMP_INPUT_FLAGS_SHIFT;
    return ( cmp_ch_list_t ) (tmp);
}

/*!
 * @brief Clear all input changed flags
 * @param baseAddr - cmp base pointer
 * @return - void
 */
static inline void CMP_HAL_ClearInputChangedFlags(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C2;
    tmp |= CMP_INPUT_FLAGS_MASK;
    baseAddr->C2 = tmp;
}

/*!
 * @brief Return how many round-robin clock cycles takes sampling
 * @param baseAddr - cmp base pointer
 * @return - number of sample clocks
 */
static inline uint8_t CMP_HAL_GetRoundRobinSamplesNumber(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C2;
    tmp = (tmp & CMP_C2_NSAM_MASK) >> CMP_C2_NSAM_SHIFT;
    return ( uint8_t ) (tmp);
}

/*!
 * @brief Set how many round-robin clock cycles takes sampling
 * @param baseAddr - cmp base pointer
 * @param to_set - number of sample clocks(min value 0, max value 3)
 * @return - void
 */
static inline void CMP_HAL_SetRoundRobinSamplesNumber(CMP_Type* const baseAddr, uint8_t to_set)
{
    uint32_t tmp = baseAddr->C2;
    tmp &= ~(CMP_C2_NSAM_MASK);
    tmp |= CMP_C2_NSAM(to_set);
    baseAddr->C2 = tmp;
}

/*!
 * @brief Return the comparator and DAC initialization delay
 * @param baseAddr - cmp base pointer
 * @return - delay(round-robin clock period)
 */
static inline uint8_t CMP_HAL_GetInitDelay(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C2;
    tmp = (tmp & CMP_C2_INITMOD_MASK) >> CMP_C2_INITMOD_SHIFT;
    return ( uint8_t ) (tmp);
}

/*!
 * @brief Set the comparator and  DAC initialization delay
 * @param baseAddr - cmp base pointer
 * @param to_set - delay (min value 0, max value 63)
 * @return - void
 */
static inline void CMP_HAL_SetInitDelay(CMP_Type* const baseAddr, uint8_t to_set)
{
    uint32_t tmp = baseAddr->C2;
    tmp &= ~(CMP_C2_INITMOD_MASK);
    tmp |= CMP_C2_INITMOD(to_set);
    baseAddr->C2 = tmp;
}

/*!
 * @brief Return last input comparison results for all channels
 * @param baseAddr - cmp base pointer
 * @return - comparison results
 */
static inline cmp_ch_list_t CMP_HAL_GetLastComparisonResult(CMP_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->C2;
    tmp = (tmp & CMP_C2_ACOn_MASK) >> CMP_C2_ACOn_SHIFT;
    return ( cmp_ch_list_t ) (tmp);
}

/*!
 * @brief Defines the pre-set state of input channels.
 * @param baseAddr cmp base pointer
 * @param to_set - state
 * @return void
 */
static inline void CMP_HAL_SetPresetState(CMP_Type* const baseAddr, cmp_ch_list_t to_set)
{
    uint32_t tmp = baseAddr->C2;
    tmp &= ~(CMP_C2_ACOn_MASK);
    tmp |= CMP_C2_ACOn(to_set);
    baseAddr->C2 = tmp;
}

/*! @}*/
#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_CMP_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

